import pandas as pd


def get_default_lump_events():
    return pd.DataFrame([
        {"나이": 41, "유형": "지출", "내용": "대출상환", "금액(만원)": 10000},
        {"나이": 41, "유형": "지출", "내용": "증여", "금액(만원)": 2000},
        {"나이": 50, "유형": "지출", "내용": "주택구입", "금액(만원)": 32000},
        {"나이": 51, "유형": "지출", "내용": "증여", "금액(만원)": 2000},
        {"나이": 61, "유형": "지출", "내용": "증여", "금액(만원)": 5000},
        {"나이": 71, "유형": "지출", "내용": "증여", "금액(만원)": 5000},
    ])


def get_default_recurring_events():
    return pd.DataFrame([
        {
            "시작나이": 40,
            "기간(년)": 20,
            "유형": "지출",
            "내용": "부모님용돈",
            "월금액(만원)": 100,
            "확정연금": False,
            "물가연동": False,
        },
        {
            "시작나이": 40,
            "기간(년)": 10,
            "유형": "수입",
            "내용": "주6일 초과근무",
            "월금액(만원)": 200,
            "확정연금": False,
            "물가연동": False,
        },
        {
            "시작나이": 47,
            "기간(년)": 5,
            "유형": "지출",
            "내용": "자동차 할부금",
            "월금액(만원)": 250,
            "확정연금": False,
            "물가연동": False,
        },
        {
            "시작나이": 60,
            "기간(년)": 30,
            "유형": "지출",
            "내용": "지역 건보료 폭탄",
            "월금액(만원)": 50,
            "확정연금": False,
            "물가연동": True,
        },
        {
            "시작나이": 70,
            "기간(년)": 20,
            "유형": "수입",
            "내용": "국민연금",
            "월금액(만원)": 100,
            "확정연금": True,
            "물가연동": True,
        },
        {
            "시작나이": 70,
            "기간(년)": 20,
            "유형": "수입",
            "내용": "주택연금",
            "월금액(만원)": 100,
            "확정연금": True,
            "물가연동": True,
        },
    ])